Revit 2026 API

# GBXMLExportOptionsEncoding Property

---

**Note: This API is now obsolete.**

The encoding options to go into the processing instruction for the exported gbXML file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
public string Encoding { get; }
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>
Public ReadOnly Property Encoding As String
	Get
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
property String^ Encoding {
	String^ get ();
}
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>]
member Encoding : string with get
```

#### Property Value

String

#### Reference

GBXMLExportOptions Class

Autodesk.Revit.DB Namespace